#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "08bbb332-f7c0-4996-a73a-c1f65b57f416" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "fa40364e-604b-4983-9ae5-ea6dbdd5a886" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "4f039689-aef8-4ecf-8472-d0cc36810911" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "c41b652f-bc57-4b1e-8355-50fc0cb9c9c5" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "3d5510d9-fa5f-4c6b-bfb4-5b54bc32b22e" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "12702379-489a-4d01-bae2-4e939ecd855a" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "88d58521-9826-41a2-be1d-805531e55832" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "582cbc31-8a5b-40f4-b4e7-da12f7adfb03" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "08bbb332-f7c0-4996-a73a-c1f65b57f416",
          - "12702379-489a-4d01-bae2-4e939ecd855a",
          - "18ddf9b5-e5a6-4eda-8927-5429c353189c",
          - "389fedcb-cda3-4360-9301-f900df8cf074",
          - "3d5510d9-fa5f-4c6b-bfb4-5b54bc32b22e",
          - "4f039689-aef8-4ecf-8472-d0cc36810911",
          - "55177101-ccaf-412e-a67e-d92de0ac11ea",
          - "582cbc31-8a5b-40f4-b4e7-da12f7adfb03",
          - "8324277a-6bc7-412b-b6f3-dd51056609af",
          - "93d26ac7-0016-430d-bf99-872a96ae58f4",
          - "b97782c3-e503-43ad-827f-39930b52c349",
          - "c41b652f-bc57-4b1e-8355-50fc0cb9c9c5",
          - "cc359c7a-a5b4-4efd-b9b3-9bb905d045a5",
          - "e99da78d-142e-446b-9074-3aaf82ebf957",
          - "ed4015b9-66cf-47ae-ab52-2475ada1784c",
          - "f20fc78f-fc0c-4ea6-a126-35d50950658a",
          - "f73b2b73-48f4-4080-8ece-e6287303c61d",
          - "fa40364e-604b-4983-9ae5-ea6dbdd5a886",
        ] -> (known after apply)
        id              = "e14041a8-874a-4bd5-8f06-91912def78b3"
        name            = "hcap-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "prime Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_create-client}" -> (known after apply)
      ~ id              = "908150c1-db05-4f43-86f9-7f8b098d762e" -> (known after apply)
        name            = "create-client"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_impersonation}" -> (known after apply)
      ~ id              = "c5b33db0-a085-4bdf-b599-6f72fbe2d2eb" -> (known after apply)
        name            = "impersonation"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-authorization}" -> (known after apply)
      ~ id              = "4e820b03-274f-4fe9-8de7-c2270f5d6c01" -> (known after apply)
        name            = "manage-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-clients}" -> (known after apply)
      ~ id              = "dbc6e47e-77b7-4d18-b4a7-cb6b8a170307" -> (known after apply)
        name            = "manage-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-events}" -> (known after apply)
      ~ id              = "a270e4cf-a6f6-4248-a451-5ee1ac65d6bf" -> (known after apply)
        name            = "manage-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-identity-providers}" -> (known after apply)
      ~ id              = "99c6dc40-643d-4b5a-bdea-d78456c0f9e5" -> (known after apply)
        name            = "manage-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-realm}" -> (known after apply)
      ~ id              = "ac14b15e-bcb4-4955-8444-1f7bc1fd314d" -> (known after apply)
        name            = "manage-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-users}" -> (known after apply)
      ~ id              = "1d649d9e-16db-45f8-b2a7-2a916465d86e" -> (known after apply)
        name            = "manage-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-clients}" -> (known after apply)
      ~ id              = "8b1585f1-b8dc-4459-9947-4c622091583b" -> (known after apply)
        name            = "query-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-groups}" -> (known after apply)
      ~ id              = "0a573829-7a59-4503-a29a-d2b7e33317e8" -> (known after apply)
        name            = "query-groups"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-realms}" -> (known after apply)
      ~ id              = "332d08b4-522a-43cc-9f88-2fab43b8a6e3" -> (known after apply)
        name            = "query-realms"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "a349e61d-4807-43a4-b0af-be2b8559d1a7" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "0056f544-f57d-43ac-a752-75d7e4a55047" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "2bc1960d-2c41-4b4c-817e-d78d1634db24" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "e09fedee-bae4-4f25-8bdb-b6e66895fcde" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "0674b49e-077d-4da0-88d7-6fd346873524" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "afa8df7d-0568-4ada-98cb-53c1565794f1" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "23367703-4ed3-4d1c-b040-bec2b2238a28" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "7e5cd05f-9654-4688-aa96-b2748364daed" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.prime.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "0056f544-f57d-43ac-a752-75d7e4a55047",
          - "0674b49e-077d-4da0-88d7-6fd346873524",
          - "0a573829-7a59-4503-a29a-d2b7e33317e8",
          - "1d649d9e-16db-45f8-b2a7-2a916465d86e",
          - "2bc1960d-2c41-4b4c-817e-d78d1634db24",
          - "332d08b4-522a-43cc-9f88-2fab43b8a6e3",
          - "4e820b03-274f-4fe9-8de7-c2270f5d6c01",
          - "7e5cd05f-9654-4688-aa96-b2748364daed",
          - "8b1585f1-b8dc-4459-9947-4c622091583b",
          - "908150c1-db05-4f43-86f9-7f8b098d762e",
          - "99c6dc40-643d-4b5a-bdea-d78456c0f9e5",
          - "a270e4cf-a6f6-4248-a451-5ee1ac65d6bf",
          - "a349e61d-4807-43a4-b0af-be2b8559d1a7",
          - "ac14b15e-bcb4-4955-8444-1f7bc1fd314d",
          - "afa8df7d-0568-4ada-98cb-53c1565794f1",
          - "c5b33db0-a085-4bdf-b599-6f72fbe2d2eb",
          - "dbc6e47e-77b7-4d18-b4a7-cb6b8a170307",
          - "e09fedee-bae4-4f25-8bdb-b6e66895fcde",
        ] -> (known after apply)
        id              = "ae162d78-aae4-4557-b847-0811d780b21b"
        name            = "prime-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "hcap Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_create-client}" -> (known after apply)
      ~ id              = "af9fcd9f-306c-44dc-89ad-c1bc955edc39" -> (known after apply)
        name            = "create-client"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_impersonation}" -> (known after apply)
      ~ id              = "2c58ac04-a2df-435e-908a-f680649ac48d" -> (known after apply)
        name            = "impersonation"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-authorization}" -> (known after apply)
      ~ id              = "b88b62ce-9403-4616-9782-71eae9e6093b" -> (known after apply)
        name            = "manage-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-clients}" -> (known after apply)
      ~ id              = "3b9f2ba7-a6de-4161-a3af-bfb6ead5e95d" -> (known after apply)
        name            = "manage-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-events}" -> (known after apply)
      ~ id              = "9674e1c2-95f1-4416-a514-d86d5b5c74c5" -> (known after apply)
        name            = "manage-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-identity-providers}" -> (known after apply)
      ~ id              = "09bdbaa7-3503-4dd1-845f-92cea06d3c28" -> (known after apply)
        name            = "manage-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-realm}" -> (known after apply)
      ~ id              = "b2311b76-717b-4368-b85b-41bca927fe82" -> (known after apply)
        name            = "manage-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-users}" -> (known after apply)
      ~ id              = "8e62c3f7-dc51-4eb0-ac74-f6168c81874d" -> (known after apply)
        name            = "manage-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-clients}" -> (known after apply)
      ~ id              = "0e479d4b-1477-419f-af66-21dfcdc88de1" -> (known after apply)
        name            = "query-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-groups}" -> (known after apply)
      ~ id              = "169c0fdc-8d50-4342-ac60-a4fd11bcde07" -> (known after apply)
        name            = "query-groups"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-realms}" -> (known after apply)
      ~ id              = "aab43548-f553-4a28-a7f9-846cd1035695" -> (known after apply)
        name            = "query-realms"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "17bf99a5-f974-49bc-bdd8-c67ed5ee2d34" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "0af3b5a4-25fa-4378-bb2c-2b497960f1a7" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "4b2b88e2-c121-414f-8a45-917587d0d247" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "b007c171-1a5d-4cb9-8b64-7252d2023f96" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "a3974fab-8b80-4044-894b-b35b2287361c" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "c08e916c-5b04-4dbc-b216-7eb74471c2ef" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "436edc56-03eb-4e37-8a10-ebf4fd4701bf" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "c8e39438-d848-4459-bd41-4bda3597491e" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.hcap.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "09bdbaa7-3503-4dd1-845f-92cea06d3c28",
          - "0af3b5a4-25fa-4378-bb2c-2b497960f1a7",
          - "0e479d4b-1477-419f-af66-21dfcdc88de1",
          - "169c0fdc-8d50-4342-ac60-a4fd11bcde07",
          - "17bf99a5-f974-49bc-bdd8-c67ed5ee2d34",
          - "2c58ac04-a2df-435e-908a-f680649ac48d",
          - "3b9f2ba7-a6de-4161-a3af-bfb6ead5e95d",
          - "4b2b88e2-c121-414f-8a45-917587d0d247",
          - "8e62c3f7-dc51-4eb0-ac74-f6168c81874d",
          - "9674e1c2-95f1-4416-a514-d86d5b5c74c5",
          - "a3974fab-8b80-4044-894b-b35b2287361c",
          - "aab43548-f553-4a28-a7f9-846cd1035695",
          - "af9fcd9f-306c-44dc-89ad-c1bc955edc39",
          - "b007c171-1a5d-4cb9-8b64-7252d2023f96",
          - "b2311b76-717b-4368-b85b-41bca927fe82",
          - "b88b62ce-9403-4616-9782-71eae9e6093b",
          - "c08e916c-5b04-4dbc-b216-7eb74471c2ef",
          - "c8e39438-d848-4459-bd41-4bda3597491e",
        ] -> (known after apply)
        id              = "fac44fa6-fa44-4b80-835a-235f7b0affca"
        name            = "hcap-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      ~ access_type                                = "BEARER-ONLY" -> (known after apply)
      + admin_url                                  = (known after apply)
      ~ authentication_flow_binding_overrides      = [] -> (known after apply)
      ~ authorization                              = [] -> (known after apply)
      ~ backchannel_logout_revoke_offline_sessions = false -> (known after apply)
      ~ backchannel_logout_session_required        = false -> (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      ~ client_authenticator_type                  = "client-secret" -> (known after apply)
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      ~ consent_required                           = false -> (known after apply)
      + description                                = (known after apply)
      ~ direct_access_grants_enabled               = false -> (known after apply)
      - display_on_consent_screen                  = false -> null
      ~ enabled                                    = true -> (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      ~ extra_config                               = {} -> (known after apply)
      ~ frontchannel_logout_enabled                = false -> (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      ~ full_scope_allowed                         = false -> (known after apply)
      ~ id                                         = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ implicit_flow_enabled                      = false -> (known after apply)
      + login_theme                                = (known after apply)
      ~ name                                       = "prime Realm" -> (known after apply)
      - oauth2_device_authorization_grant_enabled  = false -> null
      + pkce_code_challenge_method                 = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ service_accounts_enabled                   = false -> (known after apply)
      ~ standard_flow_enabled                      = true -> (known after apply)
      ~ use_refresh_tokens                         = false -> (known after apply)
      ~ use_refresh_tokens_client_credentials      = false -> (known after apply)
      ~ valid_redirect_uris                        = [] -> (known after apply)
      ~ web_origins                                = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_create-client}" -> (known after apply)
      ~ id              = "6becbdef-fe2a-4ec2-9aa5-0a403e9d3cf6" -> (known after apply)
        name            = "create-client"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_impersonation}" -> (known after apply)
      ~ id              = "5e9aa4c3-67bc-496c-beb2-dd1497908285" -> (known after apply)
        name            = "impersonation"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-authorization}" -> (known after apply)
      ~ id              = "913184be-ebd4-4a44-86e7-40430012b005" -> (known after apply)
        name            = "manage-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-clients}" -> (known after apply)
      ~ id              = "d7a8d67a-b59b-4a20-a34e-81a798ba1fde" -> (known after apply)
        name            = "manage-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-events}" -> (known after apply)
      ~ id              = "957a8df5-b0f4-40e0-9194-e990ad5f43c4" -> (known after apply)
        name            = "manage-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-identity-providers}" -> (known after apply)
      ~ id              = "03932888-5bf8-4c17-9a06-71f4455e39ae" -> (known after apply)
        name            = "manage-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-realm}" -> (known after apply)
      ~ id              = "146785de-1cb8-42c6-b043-da5295dcce24" -> (known after apply)
        name            = "manage-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_manage-users}" -> (known after apply)
      ~ id              = "ba3d6e42-c599-40bd-94ee-3a1b4ffc92e2" -> (known after apply)
        name            = "manage-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-clients}" -> (known after apply)
      ~ id              = "8a423a3f-88bc-4e81-9ddf-8068dfba8194" -> (known after apply)
        name            = "query-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-groups}" -> (known after apply)
      ~ id              = "54c5eb48-6619-4e96-93dd-e65eeb3a7a1c" -> (known after apply)
        name            = "query-groups"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-realms}" -> (known after apply)
      ~ id              = "df05cf47-a7a4-4d09-9464-2130dd0e7249" -> (known after apply)
        name            = "query-realms"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_query-users}" -> (known after apply)
      ~ id              = "08fc606a-ca29-469c-9f12-ca5ea5ad629f" -> (known after apply)
        name            = "query-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-authorization}" -> (known after apply)
      ~ id              = "8f0542f8-8eb2-4964-8874-29a72d3229f2" -> (known after apply)
        name            = "view-authorization"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-clients}" -> (known after apply)
      ~ id              = "62191e74-9d4a-47c9-ae19-9e7a1eaaff00" -> (known after apply)
        name            = "view-clients"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-events}" -> (known after apply)
      ~ id              = "d77c02e7-8368-4a2b-a9c7-a5bc101abb51" -> (known after apply)
        name            = "view-events"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-identity-providers}" -> (known after apply)
      ~ id              = "c10f8de0-54ca-4226-9494-2ce9332ec8be" -> (known after apply)
        name            = "view-identity-providers"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-realm}" -> (known after apply)
      ~ id              = "aa59c055-7a63-4045-8113-e3990f9c50c3" -> (known after apply)
        name            = "view-realm"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      ~ attributes      = {} -> (known after apply)
      ~ client_id       = "3a4f74be-8e7b-413b-b5e5-56d7f43d8148" -> (known after apply)
      ~ composite_roles = [] -> (known after apply)
      ~ description     = "${role_view-users}" -> (known after apply)
      ~ id              = "98f1e4e0-6ea8-4a7b-bc11-6daff5d05791" -> (known after apply)
        name            = "view-users"
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_test.module.custom_realms.module.prime.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "03932888-5bf8-4c17-9a06-71f4455e39ae",
          - "08fc606a-ca29-469c-9f12-ca5ea5ad629f",
          - "146785de-1cb8-42c6-b043-da5295dcce24",
          - "54c5eb48-6619-4e96-93dd-e65eeb3a7a1c",
          - "5e9aa4c3-67bc-496c-beb2-dd1497908285",
          - "62191e74-9d4a-47c9-ae19-9e7a1eaaff00",
          - "6becbdef-fe2a-4ec2-9aa5-0a403e9d3cf6",
          - "8a423a3f-88bc-4e81-9ddf-8068dfba8194",
          - "8f0542f8-8eb2-4964-8874-29a72d3229f2",
          - "913184be-ebd4-4a44-86e7-40430012b005",
          - "957a8df5-b0f4-40e0-9194-e990ad5f43c4",
          - "98f1e4e0-6ea8-4a7b-bc11-6daff5d05791",
          - "aa59c055-7a63-4045-8113-e3990f9c50c3",
          - "ba3d6e42-c599-40bd-94ee-3a1b4ffc92e2",
          - "c10f8de0-54ca-4226-9494-2ce9332ec8be",
          - "d77c02e7-8368-4a2b-a9c7-a5bc101abb51",
          - "d7a8d67a-b59b-4a20-a34e-81a798ba1fde",
          - "df05cf47-a7a4-4d09-9464-2130dd0e7249",
        ] -> (known after apply)
        id              = "ef81f9a3-bbc2-49f0-88bd-4bd10c8960ab"
        name            = "prime-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "moti-custom"
    }

  # module.keycloak_dev.module.custom_realms.module.moti-custom.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moti-custom"
      + role_ids   = [
          + "830c068f-29c3-447e-afdb-98675ffb4492",
        ]
    }

Plan: 2 to add, 12 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*